

    1.var count = new + Array()
    2.或 [数组字面量表示法]{Array}
        var colors= ['red','blue','green'] 
数组方法:
    [检测值是否为数组] Array.isArray(Value)
    [分隔符属性]      xxx.join(',')
    [栈方法 (stack)]
        push('red','green') [给数组末尾逐个添加参数,并返回修改后数组长度]
        pop()         [移除末尾最后一项,返回移除的项] [也可以说取出这一项]
    [队列方法]
        shift()       [取出第一项,](取出以后原本数组里的就没有了)
        unshift()     [给数组前端添加项,并返回修改后数组长度]
    [重排序方法]
        reverse()     [反转数组顺序]
        sort()        [会自动转成"字符串"然后才进行升序排列]
    [操作方法]
{concat()} xxx2 = xxx.concat('yellow',['black','brown']) [基于当前添加多一个数组,原来的xxx不变]
        {slice(开始的位置,结束的位置)}  [返回参数里面开始到结束的数组]

    [[splice()]]{返回一个数组}
    1.删除: 起始位置,要删除的项数
    2.插入: 起始位置,要删除的项数(写0),要添加的参数
    3.替换: 起始位置,要删除的项数,要添加的参数

    [位置方法]
        indexOf()        [查找位置  返回索引](如果找不到就返回-1)
        lastIndexOf()    [反向]
!!!   [迭代方法]
        1.every()    [运行给定函数,每一项都true 才返回true]
        2.filter()   [运行给定函数,返回会返回true项组成的数组]
        3.forEach()  [运行给定函数,这个方法没有返回值]
        4.map()      [运行给定函数,返回每次函数调用的结果组成的数组]
        5.some()     [运行给定函数,如果该函数对任一项返回true,则返回true]
        (以上方法都不会修改原来数组的值)
!!!    [缩小方法]
    1.reduce()      [遍历前到后,两个参数:(每一项调用的函数)(缩小基础初始值/可选)]
    2.reduceRight() [遍历后到前,]
